{
  "profile": {
    "name": "Yongfeng Gu",
    "title": "Full-Stack Developer · Embedded Engineer",
    "avatar": "./assets/img/avatar.jpeg",
    "contact": {
      "phone": "+86 15369998659",
      "email": "yongfenggu@tju.edu.cn",
      "github": "https://github.com/GGyongfeng",
      "website": "https://guyongfeng.cn"
    },
    "bio": "Master's student at Tianjin University, specializing in full-stack development and embedded systems. Proficient in Vue.js frontend development, Node.js backend services, embedded hardware development, and deep learning applications. With hands-on experience in multiple real-world projects, I am passionate about technology and committed to code quality and user experience.",
    "intro": "Hello! I'm Yongfeng Gu, a full-stack developer and embedded engineer from Tianjin University. I'm passionate about exploring the endless possibilities of technology, from frontend interfaces to backend services, from embedded hardware to deep learning. I enjoy every step of turning ideas into reality.",
    "tags": ["Frontend", "Backend", "Machine Learning", "Embedded", "Structural Design"],
    "other": {
      "political": "CPC Member",
      "advantages": "Passionate about work, proactive, strong self-learning ability, high self-motivation",
      "awards": "Third Prize in iCAN National Innovation Competition (Tianjin), Outstanding Student Cadre, Merit Student at Tianjin University",
      "language": "CET-6: 445"
    }
  },
  "skills": [
    {
      "category": "Frontend Development",
      "level": "Proficient",
      "proficiency": 90,
      "icon": "code-slash",
      "description": "Proficient in HTML, CSS, JavaScript core technologies; familiar with SCSS and TypeScript; expert in Vue.js framework, mastering Vue Router, Pinia, Vite ecosystem tools; skilled in using Element Plus component library for page development; capable of integrating RESTful API for frontend-backend data interaction.",
      "technologies": ["HTML", "CSS", "JavaScript", "TypeScript", "Vue.js", "SCSS", "Element Plus", "Vite"]
    },
    {
      "category": "Backend Development",
      "level": "Skilled",
      "proficiency": 75,
      "icon": "server",
      "description": "Familiar with Node.js and Express framework; able to build basic API services and handle routing and middleware logic; understand MySQL database operations; master Nginx configuration and deployment processes; capable of handling interface security, cross-origin, and data transmission.",
      "technologies": ["Node.js", "Express", "MySQL", "Nginx", "RESTful API"]
    },
    {
      "category": "Machine Learning",
      "level": "Competent",
      "proficiency": 70,
      "icon": "hardware-chip",
      "description": "Proficient in Python for data analysis and model development; master PyTorch deep learning framework, able to build and train CNN, RNN, Transformer models; equipped with data preprocessing, feature engineering, and model tuning capabilities; familiar with object detection and image classification solutions.",
      "technologies": ["Python", "PyTorch", "TensorFlow", "CNN", "RNN", "Transformer"]
    },
    {
      "category": "Embedded Development",
      "level": "Competent",
      "proficiency": 75,
      "icon": "construct",
      "description": "Master ESP32 development and ESP-IDF framework; able to write embedded programs in C/C++ for sensor control, data processing, and communication protocol integration; familiar with UART, TTL, RS485 interface protocols and debugging processes.",
      "technologies": ["ESP32", "C/C++", "ESP-IDF", "UART", "RS485"]
    },
    {
      "category": "Structural Design",
      "level": "Capable",
      "proficiency": 60,
      "icon": "cube",
      "description": "Proficient in SolidWorks and Fusion 360 for structural modeling and assembly design; capable of product shell design and interference analysis; master JLCEDA and other PCB design tools, understand circuit board size constraints and basic routing rules.",
      "technologies": ["SolidWorks", "Fusion 360", "JLCEDA", "PCB Design"]
    }
  ],
  "projects": [
    {
      "name": "Laser Coupling Alignment System",
      "company": "Tianjin Electric Power Construction",
      "role": "Embedded & Structural Engineer",
      "period": "Feb 2025 - Present",
      "link": "https://github.com/GGyongfeng/LaserCouplingAlignment_ESP32",
      "description": "Developed an automatic coupling alignment system for Tianjin Electric Power Construction Company, built a data acquisition system based on multi-sensor fusion (laser + gyroscope), replacing manual micrometer measurement, achieving non-contact real-time monitoring with 3x efficiency improvement and ±0.01mm accuracy.",
      "responsibilities": [
        "Structural design: Completed equipment structure design and shell modeling using SolidWorks",
        "Embedded development: Implemented sensor data acquisition, processing, and HTTP communication service with ESP32",
        "Host computer program: Implemented visualization interface and alignment algorithm using web technologies"
      ],
      "technologies": ["ESP32", "C++", "SolidWorks", "Vue", "485/UART", "HTTP"]
    },
    {
      "name": "Education Order Management System",
      "company": "Huixue Education",
      "role": "Full-Stack Engineer",
      "period": "Dec 2024 - Feb 2025",
      "link": "https://github.com/GGyongfeng/Huixue-frontend-manager",
      "description": "Developed an order management system for the education industry covering 6 cities, supporting 2k+ daily active users and 300+ daily orders, implementing core functions for order and user management.",
      "responsibilities": [
        "Completed frontend design and implementation for employee portal (order upload/management) and teacher portal (order receiving)",
        "Built backend services based on Express framework",
        "Designed MySQL database structure",
        "Configured Nginx reverse proxy for service deployment"
      ],
      "technologies": ["Vue3", "TypeScript", "SCSS", "Element Plus", "Node.js", "Express", "MySQL", "Nginx", "Vite"]
    },
    {
      "name": "Industrial Fixture Remote Control System",
      "company": "Jiangsu Beiren Robotics",
      "role": "Full-Stack Engineer",
      "period": "Sep 2023 - Mar 2024",
      "link": "https://romateio.guyongfeng.cn/",
      "description": "Developed a highly compatible remote control system for automotive production lines, replacing traditional fixture operation modes to meet multi-model mixed production requirements.",
      "responsibilities": [
        "Designed and developed frontend interactive interface and built server on embedded devices",
        "Implemented LAN-based real-time device status monitoring and remote control"
      ],
      "achievements": "Achieved remote production status control and real-time diagnostics, reducing downtime; supported 16 vehicle model mixed production with 93% changeover efficiency improvement.",
      "technologies": ["HTML", "CSS", "JavaScript", "jQuery", "Vue", "Node.js", "Express", "Shell", "Vite"]
    },
    {
      "name": "Deep Learning for Pediatric Pneumonia Treatment",
      "company": "Tianjin Children's Hospital",
      "role": "Algorithm Engineer",
      "period": "Jul 2024 - Sep 2024",
      "link": "https://github.com/GGyongfeng/CLASSIFIER_NRRD",
      "description": "Built a deep learning-based medical image analysis system specifically for optimizing glucocorticoid treatment dosage for refractory mycoplasma pneumonia (RMPP) in children. The system automatically assesses pneumonia severity through analysis of DICOM chest X-rays, providing treatment dosage recommendations for clinicians.",
      "responsibilities": [
        "Data preprocessing, model training, parameter tuning, and result analysis",
        "Deployed model as web application"
      ],
      "technologies": ["Python", "PyTorch", "TensorFlow", "RESNET", "MobileNetV2", "CNN"]
    }
  ],
  "education": {
    "education": [
      {
        "degree": "Master's Degree",
        "university": "Tianjin University",
        "college": "School of Precision Instruments and Optoelectronics Engineering",
        "major": "Instrument Science and Technology",
        "period": "Sep 2024 - Jun 2027"
      },
      {
        "degree": "Bachelor's Degree",
        "university": "Tianjin University",
        "college": "School of Precision Instruments and Optoelectronics Engineering",
        "major": "Intelligent Sensing Engineering",
        "period": "Sep 2020 - Jul 2024"
      }
    ],
    "campus": [
      {
        "organization": "University Student Union",
        "department": "News & Media Department",
        "position": "Director",
        "period": "Nov 2020 - Sep 2023",
        "description": "Responsible for designing work certificates, article headers, managing official account operations, and article layout design"
      },
      {
        "organization": "College Committee",
        "position": "Cultural & Sports Commissioner",
        "period": "Sep 2020 - Present",
        "description": "Organized and planned major events such as freshman welcome party and New Year's gala; led team participation in school song and history performance competition, winning excellence award"
      },
      {
        "organization": "Class",
        "position": "Class Monitor",
        "period": "Sep 2020 - Sep 2022",
        "description": "Led class team-building activities, awarded Outstanding Youth League Branch"
      },
      {
        "organization": "Party Branch",
        "position": "Publicity Committee Member",
        "period": "Jun 2022 - Present",
        "description": "Responsible for designing posters and lecture PPTs, organizing branch manuals, organizing studies, planning activities, and writing reports"
      }
    ]
  },
  "nav": {
    "home": "Home",
    "about": "About",
    "skills": "Skills",
    "projects": "Projects",
    "education": "Experience",
    "contact": "Contact"
  }
}
